using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/* Задоров Вадим. ДЗ №6
3.*Переделать программу Пример использования коллекций для решения следующих задач:
а) Подсчитать количество студентов учащихся на 5 и 6 курсах;
б) подсчитать сколько студентов в возрасте от 18 до 20 лет на каком курсе учатся (*частотный массив);
в) отсортировать список по возрасту студента;
г)*отсортировать список по курсу и возрасту студента;
*/

namespace Lesson_6
{
    partial class Program
    {
        static void Task3()
        {

        }
    }
}
